# Dataframes
Los DataFrames son la herramienta principal de Pandas y están inspirados directamente en el lenguaje de programación R. Podemos pensar en un DataFrame como un conjunto de objetos Series que comparten el mismo índice. Cada una de las columnas de un dataframe es un objeto Series.

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
np.random.seed(101)

In [3]:
rand_mat = randn(5,4)
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

## Generamos un dataframe

Pandas tomará automáticamente los datos y los formateará. Etiquetará automáticamente los índices por sus valores 0 1 2 3 y así sucesivamente, y harán lo mismo para las columnas 0 1 2 3 y así sucesivamente.

In [4]:
df = pd.DataFrame(data=rand_mat)
df

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

### Definimos el nombre del ínidice y de las columnas

In [5]:
df = pd.DataFrame(data=rand_mat,index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Seleccionar una columna

In [6]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [7]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [8]:
# Cada una de estas columnas individuales es una serie.
type(df['W'])

pandas.core.series.Series

### Seleccionar varias columnas

In [9]:
mylist = ['W', 'Y']
df[mylist]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [10]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

### Crear una columna

In [11]:
df['NEW']=df['W']+df['Y']
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

### Eliminar una columna

In [12]:
# df.drop('NEW') devuelve error
df.drop('NEW',axis=1)
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [13]:
# Si queres que desaparezca permanentemente hay que agregar inplace
df.drop('NEW',axis=1,inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Eliminar fila

In [14]:
df.drop('A') #Si queremos que sea permanente hay que usar inplace

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Seleccionar filas

In [15]:
df.loc['A'] #Seleccionar la fila A

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [16]:
df.iloc[0] #Seleccionar la fila 0, o sea en este caso la A

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [17]:
df.loc[['A','E']] # Seleccionar la fila A y la fila E

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df.iloc[[0,3]] # Seleccionar la fila 0 y la fila 3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057

### Seleccionar algunos valores en específico

In [19]:
df.loc[['A','E']][['Y','Z']] # Seleccionar las filas A y E, y las columnas Y y Z

          Y         Z
A  0.907969  0.503826
E  2.605967  0.683509

In [20]:
df.loc[['A','E'],['Y','Z']] # Otra forma de hacer lo mismo pero con una , en lugar de corchetes

          Y         Z
A  0.907969  0.503826
E  2.605967  0.683509

In [21]:
df>0 # Ver True/False si los valores son >0 o no

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [22]:
df_bool = df>0
df_bool

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [23]:
df[df_bool] # Muestra los valores para los que es True la condicion, sino muestra NaN

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
# Otra forma de hacer lo mismo
df[df>0] # Muestra los valores para los que es True la condicion, sino muestra NaN

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df['W']>0 # Ver True/False si los valores son >0 o no para la columna W

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [26]:
df[df['W']>0] # Solo devuelve las filas para las que es True; no muestra la fila C

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
# Si de lo anterior solo querés ver la columna Z
df[df['W']>0]['Z']

A    0.503826
B    0.605965
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [28]:
# Si de lo anterior solo querés ver la columna Z para la fila A
df[df['W']>0]['Z'].loc['A']

np.float64(0.5038257538223936)

In [29]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
cond1 = df['W']>0
cond2 = df['Y']>1
df[cond1 & cond2] #and

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df[cond1 | cond2] #or

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
# Si quiero saber cuantos valores de la columna W son >0
ser_w = df['W']>0
ser_w.value_counts()

W
True     4
False    1
Name: count, dtype: int64

In [33]:
sum(ser_w) #Devuelve la suma de los True

4

In [34]:
len(ser_w) #Devuelve la cantidad total

5

## Indice

In [35]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [36]:
df # Ese nuevo índice no se va a guardar si no escribimos df.reset_index(inplace=True)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Queremos cambiar el índice

In [37]:
new_ind = 'CA NY WY OR CO'.split()
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [38]:
# Agregamos una nueva columna al df
df['States'] = new_ind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [39]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [40]:
df #De nuevo, no se guarda en el df original salvo que definamos df.set_index('States',inplace=True)

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [41]:
df.set_index('States',inplace=True)
df 
# Notemos que el índice original se pierda

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Obtener resumenes del df

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [43]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [44]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

## Missing Data

Missing Data has only 3 options:
1. **Keep** the missing data (NaN), if the forecasting method can handle it.
2. **Drop** the missing data (the entire row including the timestamp).
3. **Fill in** the missing data with some value (best estimated guess).

**There is no “correct” approach, since each case will be different**. It will be up to you to decide what method to choose. Fortunately, by their very nature, many sources of time series data rarely have missing information.

In [45]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### Opción 1: Seguir adelante con los datos como están, manteniendo los datos faltantes

### Opción 2: Eliminar los datos faltantes

In [46]:
# Elimina la FILA COMPLETA si hay algún dato NaN en ella
df.dropna()

     A    B  C
0  1.0  5.0  1

In [47]:
# Elimina la COLUMNA COMPLETA si hay algún dato NaN en ella
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [48]:
df
# Para que tenga un efecto permanente hay que asignar ,inplace=True o reasignar df=df.dropna()

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [49]:
# Elimina la FILA COMPLETA si hay 2 datos NaN en ella
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

### Opción 3: Completar los datos que faltan

In [50]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [51]:
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [52]:
df.mean() # Devuelve el promedio de cada columna

A    1.5
B    5.0
C    2.0
dtype: float64

In [53]:
df.fillna(df.mean()) # Completamos los valores faltantes con el promedio de cada columna

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [54]:
# También podemos completar un valor faltante para una columna solamente
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Group By

A menudo, es posible que desee realizar un análisis basado en el valor de una columna específica, lo que significa que desea agrupar otras columnas en función de otra.
Para ello, realizamos 3 pasos:
1. Split (Dividir)
2. Apply (Aplicar)
3. Combine (Combinar)

Pandas realiza todo esto con una simple llamada al método .groupby(). Pandas automáticamente hará que la columna agrupada sea el índice del nuevo DataFrame resultante.
![Group By Pandas](groupby_pandas.png)

In [55]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [56]:
df.groupby('Company')

In [57]:
by_comp = df.groupby("Company")
by_comp['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [58]:
by_comp['Sales'].max()

Company
FB      350
GOOG    200
MSFT    340
Name: Sales, dtype: int64

In [59]:
by_comp['Sales'].std()

Company
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: Sales, dtype: float64

In [60]:
by_comp['Sales'].describe()

         count   mean         std    min     25%    50%     75%    max
Company
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [61]:
by_comp['Sales'].describe().transpose()

Company          FB        GOOG        MSFT
count      2.000000    2.000000    2.000000
mean     296.500000  160.000000  232.000000
std       75.660426   56.568542  152.735065
min      243.000000  120.000000  124.000000
25%      269.750000  140.000000  178.000000
50%      296.500000  160.000000  232.000000
75%      323.250000  180.000000  286.000000
max      350.000000  200.000000  340.000000

## Common Operations

In [62]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [63]:
df['col2'].unique() #Valores distintos

array([444, 555, 666])

In [64]:
df['col2'].nunique() #Cantidad de valores distintos

3

In [65]:
len(df['col2'].unique()) #Pide la longitud de los valores distintos, o sea termina siendo cant de valores distitnos

3

In [66]:
df['col2'].value_counts() #Muestra los valores distintos y cuantos hay de cada uno

col2
444    2
555    1
666    1
Name: count, dtype: int64

### Selecting Data

In [67]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

### Applying Functions

In [68]:
def times2(x):
    return x*2

In [69]:
times2(4)

8

In [70]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [71]:
df.apply(times2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [72]:
df['col1'].apply(times2) #Le aplico la función a solo una columna del df

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [73]:
df['new'] = df['col1'].apply(times2) #Le aplico la función a solo una columna del df, y lo guardo en una nueva columna del df
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

### More Functions

In [74]:
del df['new'] #Borramos la columna new
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [75]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [76]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [78]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [79]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [80]:
df.sort_values(by='col2',ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

## Data Input and Output

![Data Pandas](data_pandas.png)

### CSV
Comma Separated Values files are text files that use commas as field delimeters.<br>
Unless you're running the virtual environment included with the course, you may need to install <tt>xlrd</tt> and <tt>openpyxl</tt>.<br>
In your terminal/command prompt run:

    conda install xlrd
    conda install openpyxl

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

In [ ]:
# Input
df = pd.read_csv('example.csv')

# Output
df.to_csv('example.csv',index=False)

### Excel
Pandas can read and write MS Excel files. However, this only imports data, not formulas or images. A file that contains images or macros may cause the <tt>.read_excel()</tt>method to crash.

In [ ]:
# Input
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

# Output
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

### HTML
Pandas can read table tabs off of HTML.<br>
Unless you're running the virtual environment included with the course, you may need to install <tt>lxml</tt>, <tt>htmllib5</tt>, and <tt>BeautifulSoup4</tt>.<br>
In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install beautifulsoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

In [ ]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
df[0].head()